app/controllers/wallets_controller.rb

  def index
    @wallets = Wallet.all
---
SELECT "wallets".* FROM "wallets"

  def create
    @wallet = Wallet.new(wallet_params)

    respond_to do |format|
      if @wallet.save
---
INSERT INTO "wallets" ("name", "short_name", "currency", "balance", "is_credit_card", "created_at", "updated_at") VALUES (NULL, NULL, NULL, 0.0, FALSE, '2025-09-29 02:53:21.364489', '2025-09-29 02:53:21.364489') RETURNING "id"